// Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. 
// Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
let celsius = parseFloat(prompt("Введіть температуру в Цельсіях"));
let fahrenheit = (celsius * 9 / 5) + 32;
if (celsius && fahrenheit) {
    console.log(`Температура в Цельсіях: ${celsius}°C`);
    console.log(`Температура у Фаренгейтах: ${fahrenheit}°F`);
} else { console.error("Щось пішло не так!") }

//Створити змінну для зберігання кількості днів у місяці.
//Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
let days = parseFloat(prompt("Введіть кількість днів"));
if (days) {
    let hours = days * 24
    let minutes = hours * 60
    console.log(`${hours} Години`)
    console.log(`${minutes} Хвилини`)
} else { console.error("Щось пішло не так!") }

//Створити змінні для зберігання рівня здоров'я та енергії гравця в грі.
//Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
const player = {
    healt: 100,
    energy: 200
}
player.healt -= 10;
player.energy -= 20;
console.log(`healt: ${player.healt}\nenergy:${player.energy}`)

//Створити змінну для зберігання суми покупки в магазині.
//Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.
let purchaseAmount = confirm("Бажаєте оплатити цю покупку? З вас зніметься 1000 грн.");
let discount = 0.10;
let amount = 1000;
purchaseAmount ? console.log(`Сума після застосування знижки: ${amount * (1 - discount)}`) : alert("Дію відмінено");

// Створити змінну для зберігання числа з плаваючою комою. 
//Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
let floorString = 0.3;
console.log(Math.floor(floorString))

//Створити змінну для зберігання рядка, який містить числа з плаваючою комою. 
//Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.
let floatString = "0.3123fds";
console.log(parseFloat(floatString))

//Створити змінну для зберігання рядка, який містить ціле число. 
//Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
let integerString = "250sdagww";
console.log(parseInt(integerString));

// Створити змінну для зберігання числа. 
//Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
let sqrtString = 16;
console.log(Math.sqrt(sqrtString))

// Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. 
//Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
//Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.
let integerValue = 150.3;
let stringNumber = "200.23";
console.log(parseInt(stringNumber));
console.log(integerValue.toString());